select "Н_УЧЕНИКИ"."ЧЛВК_ИД",
       "Н_ЛЮДИ"."ФАМИЛИЯ",
       "Н_ЛЮДИ"."ИМЯ",
       "Н_ЛЮДИ"."ОТЧЕСТВО",
       avg(cast("Н_ВЕДОМОСТИ"."ОЦЕНКА" as decimal)) as Средняя_оценка
from "Н_УЧЕНИКИ"
         join "Н_ОБУЧЕНИЯ" on "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД"
         join "Н_ЛЮДИ" on "Н_ЛЮДИ"."ИД" = "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД"
         join "Н_ВЕДОМОСТИ" on "Н_ЛЮДИ"."ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
where "Н_ВЕДОМОСТИ"."ОЦЕНКА" ~ '^[0-9]+$'
  and "Н_УЧЕНИКИ"."ГРУППА" = '4100'
group by ("Н_УЧЕНИКИ"."ЧЛВК_ИД", "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ЛЮДИ"."ИМЯ", "Н_ЛЮДИ"."ОТЧЕСТВО")
having avg(cast("Н_ВЕДОМОСТИ"."ОЦЕНКА" as decimal)) > (select cast(min("Н_ВЕДОМОСТИ"."ОЦЕНКА") as decimal)
                                                       from "Н_ВЕДОМОСТИ"
                                                                join "Н_ЛЮДИ" on "Н_ЛЮДИ"."ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
                                                                join "Н_ОБУЧЕНИЯ" on "Н_ЛЮДИ"."ИД" = "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД"
                                                                join "Н_УЧЕНИКИ" on "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
                                                       where "ГРУППА" = '1100'
                                                         and "Н_ВЕДОМОСТИ"."ОЦЕНКА" ~ '^[0-9]+$')
;


-- select "Н_ВЕДОМОСТИ"."ЧЛВК_ИД", AVG(cast("Н_ВЕДОМОСТИ"."ОЦЕНКА" as decimal)) as Средняя_оценка
-- from "Н_ВЕДОМОСТИ"
-- where "Н_ВЕДОМОСТИ"."ОЦЕНКА" ~ '^[0-9]+$'
-- group by "Н_ВЕДОМОСТИ"."ЧЛВК_ИД";
