select count(*) from (select "Н_ВЕДОМОСТИ"."ЧЛВК_ИД", max("Н_ВЕДОМОСТИ"."БУКВА")
                      from "Н_ВЕДОМОСТИ"
                      where "Н_ВЕДОМОСТИ"."БУКВА" is not null
                      group by "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
                      having max("Н_ВЕДОМОСТИ"."БУКВА") <= 'D'
) as counter;

select "Н_ВЕДОМОСТИ"."ЧЛВК_ИД", max("Н_ВЕДОМОСТИ"."БУКВА")
from "Н_ВЕДОМОСТИ"
where "Н_ВЕДОМОСТИ"."БУКВА" is not null
group by "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
having max("Н_ВЕДОМОСТИ"."БУКВА") <= 'D'