select "Н_СЕССИЯ"."ЧЛВК_ИД", "НАЧАЛО"
from "Н_УЧЕНИКИ"
         join "Н_ОБУЧЕНИЯ" on "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД"
         join "Н_ЛЮДИ" on "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
         join "Н_СЕССИЯ" on "Н_СЕССИЯ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
         join "Н_ПЛАНЫ" on "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
         join "Н_ОТДЕЛЫ" on "Н_ОТДЕЛЫ"."ОТД_ИД" = "Н_ПЛАНЫ"."ОТД_ИД"
where "Н_СЕССИЯ"."ЧЛВК_ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
  and "Н_ОТДЕЛЫ"."КОРОТКОЕ_ИМЯ" in ('ВТ', 'КТиУ', 'ПИиКТ')
  and to_char("Н_УЧЕНИКИ"."НАЧАЛО", 'yyyy') like '20%';
